## PAIR PROGRAMMING PANDAS I 
---

**EJERCICIO 1**

¬øQu√© diferencia hay entre una Serie y un DataFrame?

> La diferencia principal es la estructura de datos, siendo en la serie una dimensi√≥n y en el dataframe tiene dos.

---

**EJERCICIO 2**

Momento de trabajar con Series. Contestad a las siguientes preguntas:
- Crea dos listas:
    - Una que se llame "valores" que tenga 7 n√∫meros aleatorios.
    - Otra que se llame "indices" que tenga 7 strings que se llamen como los d√≠as de la semana.
- A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los √≠ndices de la Serie.
- A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto tenemos el m√©todo zip que nos permite iterar por dos listas a la vez. M√°s informci√≥n sobre este m√©todo aqu√≠.
- Crea una Serie con el diccionario creado en el punto anterior.
- ¬øQu√© forma tiene esta √∫ltima Serie?
- ¬øQu√© tipo de datos tiene?
- ¬øQu√© tama√±o tiene?
- ¬øCu√°les son los √≠ndices de la Serie?
- ¬øY los values?
- Extraed el valor para el √≠ndice "lunes"
- Extraed el valor para el √≠ndice "lunes", "martes" y "mi√©rcoles".
- Extraed el valor para el √≠ndice "lunes" y "domingo".

In [108]:
import pandas as pd
import numpy as np

In [109]:

lista_valores = [3, 13, 7, 45, 9, 6, 22]
lista_indices= ['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado', 'domingo']

In [110]:
# Creamos una serie con las dos listas, utilizando una de ellas para los √≠ndices y la otra para los values.

Serie1= pd.Series(lista_valores, index = ['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado', 'domingo'])
Serie1

lunes         3
martes       13
miercoles     7
jueves       45
viernes       9
sabado        6
domingo      22
dtype: int64

In [111]:
# Definimos una funci√≥n para crear un diccionario de la serie anterior, para poder iterar por las listas de la serie, 
# utilizamos el m√©todo zip.

diccionario_series= list(zip(lista_indices, lista_valores))

def crear_dicc_serie(lista):
    dicc_vacio = {}

    for i,e in diccionario_series:
        dicc_vacio[i] = e

    return dicc_vacio

In [112]:
crear_dicc_serie(diccionario_series)

{'lunes': 3,
 'martes': 13,
 'miercoles': 7,
 'jueves': 45,
 'viernes': 9,
 'sabado': 6,
 'domingo': 22}

In [113]:
# Creamos una serie con el diccionario anterior utilizando el pd.Series y poniendo entre par√©ntesis el diccionario que queremos convertir.

Serie2 = pd.Series(crear_dicc_serie(diccionario_series))
Serie2

lunes         3
martes       13
miercoles     7
jueves       45
viernes       9
sabado        6
domingo      22
dtype: int64

In [114]:
# Forma

Serie2.shape

(7,)

In [115]:
# Tipo

Serie2.dtype

dtype('int64')

In [116]:
# Tama√±o/n¬∫ elementos

Serie2.size

7

In [117]:
# Comprobamos los √≠ndices de la serie

Serie2.index

Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')

In [118]:
# Comprobamos los values de la serie

Serie2.values

array([ 3, 13,  7, 45,  9,  6, 22])

In [119]:
# Extraemos el valor para el √≠ndice "lunes"

#Utilizamos el m√©todo values indicando el √≠ndice del que queremos obtener el valor
Serie2.values[0]

# LLamando al √≠ndice de la key nos da el value
Serie2[0]

3

In [120]:
# Extraemos el valor para el √≠ndice "lunes", "martes" y "mi√©rcoles" con el m√©todo value y el rango de los √≠ndices que queremos 
# entre corchetes

Serie2.values[0:3]

array([ 3, 13,  7])

In [121]:
# Extraemos el valor para el √≠ndice "lunes" y "domingo" con el m√©todo values e indicando entre dos corchetes el primer y √∫ltimo √≠ndice,
# separ√°ndolo con coma en vez con dos puntos como para el rango.

Serie2.values[[0 , -1]]

array([ 3, 22])

---

**EJERCICIO 3**

Es el turno de los DataFrames

- Cread un array de dos dimensiones con 4 filas y 3 columnas.
- Convertid el array en un DataFrame donde las columnas se llamen "Espa√±a", "Francia" e "Italia".
- Descargad el archivo "medallas" y cargad el DataFrame con la siguiente l√≠nea de c√≥digo:

df = pd.read_csv("medallas.csv", index_col=["Pa√≠s"])

üìå NOTA Para evitar problemas guardar el archivo medallas.csv a la misma altura (en la misma carpeta) que el jupyter donde estamos trabajando.

- Usando el loc extraed todas las columnas de la fila.
- Usando el loc extraed todas las columnas de China e Ir√°n.
- Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Ir√°n.
- Usando el iloc extraed la informaci√≥n de la India. Devolved todas las columnas.
- Usando el iloc extraed todas las columnas de los paises que est√©n en posici√≥n impar. La primera que nos tendr√≠a que salir es Jap√≥n y la √∫ltima Corea del Norte.
- Utilizando el c√≥digo del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".
- Contestad a las siguientes preguntas:
    - ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro?
    - ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro y m√°s de 1000 de plata?
    - ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro o m√°s de 700 de bronce?
    - Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.
    - Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada pa√≠s.

In [123]:
# Creamos un array 2D utilizando el metodo ramdon.randint con los n√∫meros aleatorios entre 1 y 50,  
# y le pasamos el n√∫mero de filas y columnas entre par√©ntesis.

array1 = np.random.randint(1,50, (4,3))
array1

array([[22,  7, 20],
       [ 7,  4,  8],
       [44, 32, 18],
       [41, 45, 21]])

In [124]:
# Convertimos el array en un DataFrame, asignando el nombre de las columnas

medallas = pd.DataFrame(array1, columns = ["Espa√±a", "Francia", "Italia"])
medallas

   Espa√±a  Francia  Italia
0      22        7      20
1       7        4       8
2      44       32      18
3      41       45      21

In [125]:
# Descargamos el archivo con el c√≥digo facilitado

df = pd.read_csv("medallas.csv", index_col=["Pa√≠s"])

In [126]:
df.head()

               Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China                   1  1473    994     720
Jap√≥n                   2  1032   1037     985
Corea del Sur           3   745    663     827
Ir√°n                    4   179    181     197
Kazajist√°n              5   155    158     224

In [127]:
df.loc[:, :]

                 Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China                     1  1473    994     720
Jap√≥n                     2  1032   1037     985
Corea del Sur             3   745    663     827
Ir√°n                      4   179    181     197
Kazajist√°n                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taip√©i              9    99    144     276
Corea del Norte          10    91    120     235

In [128]:
df.loc[["China", "Ir√°n"], : "Bronce"]

       Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China           1  1473    994     720
Ir√°n            4   179    181     197

In [129]:
df.loc[["China", "Ir√°n"], "Oro":"Bronce"]

        Oro  Plata  Bronce
Pa√≠s
China  1473    994     720
Ir√°n    179    181     197

In [130]:
df.iloc[5, :]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

In [131]:
# La posici√≥n del los √≠ndices de python es impar, pero la posici√≥n de los √≠ndices que se muestran en el 
# dataframe son pares. Start 1 en jap√≥n, 10 para la √∫ltima fila y saltos de 2.

df.iloc[1:10:2, :]

                 Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
Jap√≥n                     2  1032   1037     985
Ir√°n                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

In [132]:
df.iloc[1:10:2, 1:4]

                  Oro  Plata  Bronce
Pa√≠s
Jap√≥n            1032   1037     985
Ir√°n              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

In [133]:
 # ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro?
 
df.loc[df.Oro > 200]

               Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China                   1  1473    994     720
Jap√≥n                   2  1032   1037     985
Corea del Sur           3   745    663     827

In [134]:
# ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro o m√°s de 700 de bronce?


df.loc[(df.Oro > 200) | (df.Bronce > 700)]

               Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China                   1  1473    994     720
Jap√≥n                   2  1032   1037     985
Corea del Sur           3   745    663     827

In [135]:
# Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.

#df.drop(df.columns[0], axis= 1)

df = df.drop(['Unnamed: 0'],axis =1)
df

                  Oro  Plata  Bronce
Pa√≠s
China            1473    994     720
Jap√≥n            1032   1037     985
Corea del Sur     745    663     827
Ir√°n              179    181     197
Kazajist√°n        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taip√©i       99    144     276
Corea del Norte    91    120     235

In [137]:
# Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las 
# medallas obtenidas por cada pa√≠s.

df['Resultado'] = (df['Oro']+df['Plata']+df['Bronce'])
df

                  Oro  Plata  Bronce  Resultado
Pa√≠s
China            1473    994     720       3187
Jap√≥n            1032   1037     985       3054
Corea del Sur     745    663     827       2235
Ir√°n              179    181     197        557
Kazajist√°n        155    158     224        537
India             154    202     315        671
Tailandia         132    175     278        585
Indonesia         112    131     240        483
China Taip√©i       99    144     276        519
Corea del Norte    91    120     235        446

In [138]:
df.head(10)

                  Oro  Plata  Bronce  Resultado
Pa√≠s
China            1473    994     720       3187
Jap√≥n            1032   1037     985       3054
Corea del Sur     745    663     827       2235
Ir√°n              179    181     197        557
Kazajist√°n        155    158     224        537
India             154    202     315        671
Tailandia         132    175     278        585
Indonesia         112    131     240        483
China Taip√©i       99    144     276        519
Corea del Norte    91    120     235        446